artillery-queue.yml
config:
  target: "https://thechaicouple.vercel.app"
  phases:
    - duration: 10
      arrivalRate: 10  # 10 requests per second
      maxVusers: 50
  processor: "./artillery-processor.js"
scenarios:
  - name: "Join Queue"
    weight: 100
    flow:
      - function: "setUserData"
      - post:
          url: "/api/join"
          headers:
            Content-Type: "application/json"
          json:
            name: "{{ userName }}"
            items: "{{ userItems }}"
          capture:
            - json: "$.id"
              as: "ticketId"
            - json: "$.position"
              as: "position"
          expect:
            - statusCode: 201